IRP/src/Documents/IncomingExchRateAdjustmentInvoice/IncomingExchRateAdjustmentInvoice.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>IncomingExchRateAdjustmentInvoice</name>
 <registerRecords>AccumulationRegister.R5022T_Expenses</registerRecords>
 <registerRecords>AccumulationRegister.R1021B_VendorsTransactions</registerRecords>
 <registerRecords>AccumulationRegister.T1050T_AccountingQuantities</registerRecords>
 <registerRecords>AccumulationRegister.R1040B_TaxesOutgoing</registerRecords>
 <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
 <registerRecords>AccumulationRegister.R5020B_PartnersBalance</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_AccountingAmounts</registerRecords>
 <attributes>
  <name>Agreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </attributes>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </attributes>
 <attributes>
  <name>DocDate</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>DocNumber</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>PriceIncludeTax</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>LegalNameContract</name>
  <type>
   <types>CatalogRef.LegalNameContracts</types>
  </type>
 </attributes>
 <tabularSections>
  <name>ItemList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Item</name>
   <type>
    <types>CatalogRef.Items</types>
   </type>
  </attributes>
  <attributes>
   <name>ItemKey</name>
   <type>
    <types>CatalogRef.ItemKeys</types>
   </type>
  </attributes>
  <attributes>
   <name>Unit</name>
   <type>
    <types>CatalogRef.Units</types>
   </type>
  </attributes>
  <attributes>
   <name>Quantity</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>Price</name>
   <type>
    <types>DefinedType.typePrice</types>
   </type>
  </attributes>
  <attributes>
   <name>PriceType</name>
   <type>
    <types>CatalogRef.PriceTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>TaxAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>TotalAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>NetAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>ProfitLossCenter</name>
   <type>
    <types>CatalogRef.BusinessUnits</types>
   </type>
  </attributes>
  <attributes>
   <name>ExpenseType</name>
   <type>
    <types>CatalogRef.ExpenseAndRevenueTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>AdditionalAnalytic</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>DontCalculateRow</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>QuantityInBaseUnit</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>IsService</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>QuantityIsFixed</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>VatRate</name>
   <type>
    <types>CatalogRef.TaxRates</types>
   </type>
  </attributes>
  <attributes>
   <name>Project</name>
   <type>
    <types>CatalogRef.Projects</types>
   </type>
  </attributes>
  <attributes>
   <name>Invoice</name>
   <type>
    <types>DocumentRef.PurchaseInvoice</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>Currencies</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyFrom</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>Rate</name>
   <type>
    <types>DefinedType.typeCurrencyRate</types>
   </type>
  </attributes>
  <attributes>
   <name>ReverseRate</name>
   <type>
    <types>DefinedType.typeCurrencyRate</types>
   </type>
  </attributes>
  <attributes>
   <name>ShowReverseRate</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Multiplicity</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>10</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>MovementType</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>IsFixed</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/Documents/IncomingExchRateAdjustmentInvoice/ObjectModule.bsl
Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If CurrenciesServer.NeedUpdateCurrenciesTable(ThisObject) Then
		
		CurrenciesClientServer.DeleteUnusedRowsFromCurrenciesTable(ThisObject.Currencies, ThisObject.ItemList);
		For Each Row In ThisObject.ItemList Do
			Parameters = CurrenciesClientServer.GetParameters_ExchDiffInvoce(ThisObject, Row);
			CurrenciesClientServer.DeleteRowsByKeyFromCurrenciesTable(ThisObject.Currencies, Row.Key);
			CurrenciesServer.UpdateCurrencyTable(Parameters, ThisObject.Currencies);
		EndDo;
		
	EndIf;
	
	ThisObject.AdditionalProperties.Insert("WriteMode", WriteMode);
	
	ThisObject.DocumentAmount = ThisObject.ItemList.Total("TotalAmount");
	ThisObject.AdditionalProperties.Insert("OriginalDocumentDate", PostingServer.GetOriginalDocumentDate(ThisObject));
	ThisObject.AdditionalProperties.Insert("IsPostingNewDocument" , WriteMode = DocumentWriteMode.Posting And Not Ref.Posted);
EndProcedure

Procedure OnWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
	
	WriteMode = CommonFunctionsClientServer.GetFromAddInfo(ThisObject.AdditionalProperties, "WriteMode");
	If FOServer.IsUseAccounting() And WriteMode = DocumentWriteMode.Posting Then
		AccountingServer.OnWrite(ThisObject, Cancel);
	EndIf;
EndProcedure

Procedure BeforeDelete(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure Posting(Cancel, PostingMode)
	PostingServer.Post(ThisObject, Cancel, PostingMode, ThisObject.AdditionalProperties);
EndProcedure

Procedure UndoPosting(Cancel)
	UndopostingServer.Undopost(ThisObject, Cancel, ThisObject.AdditionalProperties);
EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)
	If FillingData = Undefined Then
		FillingData = New Structure();
		FillPropertyValues(ThisObject, FillingData);
		ControllerClientServer_V2.SetReadOnlyProperties(ThisObject, FillingData);
	EndIf;
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	Return;
EndProcedure
